Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus performs some magic when it is capable of inferring the serialized types from the REST methods. When you have the following REST method, Quarkus determines that `Fruit` will be serialized:
ja_jp: Quarkusは、RESTメソッドからシリアライズされた型を推論することができる場合に、何らかのマジックを実行します。以下のようなRESTメソッドがある場合、Quarkusは、 `Fruit` がシリアライズされると判断します。

source: Quarkus platform BOMs imported in the project (BOMs imported by parent POMs will also be reported)
ja_jp: プロジェクトにインポートされた Quarkus プラットフォーム BOM (親 POM によってインポートされた BOM も報告されます)

source: Quarkus platform descriptor is a JSON artifact that provides information about the platform and its extensions to the Quarkus tools. E.g. http://code.quarkus.io and the Quarkus command line tools consult this descriptor to list, add and remove extensions to/from the project on user's request. This artifact is also used as a Quarkus platform identifier. When Quarkus tools need to identify the Quarkus platform(s) used in the project, they will analyze the dependency version constraints of the project (the effective list of the managed dependencies from the `dependencyManagement` section in Maven terms) looking for the platform descriptor artifact(s) among them. Given that the platform descriptors are included into the Quarkus platform BOMs, every Quarkus application will inherit the platform descriptor artifact from the imported platform BOM(s) as a dependency version constraint (managed dependency in Maven terms).
ja_jp: Quarkusプラットフォームディスクリプタは、プラットフォームとそのエクステンションに関する情報をQuarkusツールに提供するJSONアーティファクトです。例： http://code.quarkus.io やQuarkusコマンドラインツールは、ユーザーの要求に応じて、このディスクリプタを参照して、プロジェクトへのエクステンションのリスト化、追加、削除を行います。このアーティファクトは、Quarkusプラットフォームディスクリプタとしても使用されます。Quarkusツールがプロジェクトで使用されているQuarkusプラットフォームを識別する必要がある場合、プロジェクトの依存関係バージョン制約（Maven用語では、 `dependencyManagement` セクションから管理されている依存関係の有効なリスト）を分析して、その中からプラットフォームディスクリプタのアーティファクトを探します。プラットフォームディスクリプタがQuarkusプラットフォームBOMに含まれていることを考えると、すべてのQuarkusアプリケーションは、インポートされたプラットフォームBOMからのプラットフォームディスクリプタアーティファクトを依存関係バージョン制約（Maven用語では管理された依存関係）として継承します。

source: Quarkus platform descriptor is a JSON artifact that provides information about the platform and its extensions to the Quarkus tools. E.g. https://code.quarkus.io/ and the Quarkus command line tools consult this descriptor to list, add and remove extensions to/from the project on user's request. This artifact is also used as a Quarkus platform identifier. When Quarkus tools need to identify the Quarkus platform(s) used in the project, they will analyze the dependency version constraints of the project (the effective list of the managed dependencies from the `dependencyManagement` section in Maven terms) looking for the platform descriptor artifact(s) among them. Given that the platform descriptors are included into the Quarkus platform BOMs, every Quarkus application will inherit the platform descriptor artifact from the imported platform BOM(s) as a dependency version constraint (managed dependency in Maven terms).
ja_jp: Quarkusプラットフォームディスクリプタは、プラットフォームとそのエクステンションに関する情報をQuarkusツールに提供するJSONアーティファクトです。例： http://code.quarkus.io やQuarkusコマンドラインツールは、ユーザーの要求に応じて、このディスクリプタを参照して、プロジェクトへのエクステンションのリスト化、追加、削除を行います。このアーティファクトは、Quarkusプラットフォームディスクリプタとしても使用されます。Quarkusツールがプロジェクトで使用されているQuarkusプラットフォームを識別する必要がある場合、プロジェクトの依存関係バージョン制約（Maven用語では、 `dependencyManagement` セクションから管理されている依存関係の有効なリスト）を分析して、その中からプラットフォームディスクリプタのアーティファクトを探します。プラットフォームディスクリプタがQuarkusプラットフォームBOMに含まれていることを考えると、すべてのQuarkusアプリケーションは、インポートされたプラットフォームBOMからのプラットフォームディスクリプタアーティファクトを依存関係バージョン制約（Maven用語では管理された依存関係）として継承します。

source: Quarkus platform is a set of extensions that target the primary use-cases of Quarkus as a development framework and can safely be used in any combination in the same application without creating a dependency conflict. From an application developer perspective, a Quarkus platform is represented as one or more Maven BOMs, for example `io.quarkus.platform:quarkus-bom:{quarkus-version}`, `io.quarkus.platform:quarkus-kogito-bom:{quarkus-version}`, etc, whose dependency version constraints were globally aligned so that these BOMs can be imported in the same application in any order without introducing a dependency conflict.
ja_jp: Quarkusプラットフォームは、開発フレームワークとしてのQuarkusの主要なユースケースを対象としたエクステンションのセットであり、依存関係の競合を生じることなく、同じアプリケーション内で任意の組み合わせで安全に使用できます。アプリケーション開発者の視点では、Quarkusプラットフォームは、 `io.quarkus.platform:quarkus-bom:{quarkus-version}` 、 `io.quarkus.platform:quarkus-kogito-bom:{quarkus-version}` などの1つまたは複数のMaven BOMとして表現されます。これらのBOMは、依存関係のバージョン制約がグローバルに調整されているため、依存関係の競合を引き起こすことなく、同じアプリケーションに任意の順序でインポートできます。

source: Quarkus platform is a set of extensions that target the primary use-cases of Quarkus as a development framework and can safely be used in any combination in the same application without creating a dependency conflict. From an application developer perspective, a Quarkus platform is represented as one or more Maven BOMs, for example `{quarkus-platform-groupid}:quarkus-bom:{quarkus-version}`, `{quarkus-platform-groupid}:quarkus-camel-bom:{quarkus-version}`, etc, whose dependency version constraints were globally aligned so that these BOMs can be imported in the same application in any order without introducing a dependency conflict.
ja_jp: Quarkusプラットフォームは、開発フレームワークとしてのQuarkusの主なユースケースをターゲットとしたエクステンションのセットであり、依存関係の競合を発生させることなく、同じアプリケーション内でどのような組み合わせでも安全に使用できます。アプリケーション開発者の視点から見ると、Quarkusプラットフォームは、1つまたは複数のMaven BOMとして表現されます。例えば、 `{quarkus-platform-groupid}:quarkus-bom:{quarkus-version}` 、 `{quarkus-platform-groupid}:quarkus-camel-bom:{quarkus-version}` などです。これらのBOMは、依存関係の競合を発生させることなく、同じアプリケーションで任意の順序でインポートできるように、依存関係のバージョン制約がグローバルに調整されています。

source: Quarkus project info
ja_jp: Quarkus プロジェクト情報

source: Quarkus project rectify
ja_jp: Quarkus プロジェクト修正

source: Quarkus project scaffolding automatically installs the Gradle wrapper (`./gradlew`) in your project.
ja_jp: Quarkusプロジェクトのスキャフォールドは、プロジェクトにGradleラッパー( `./gradlew` )を自動的にインストールします。

source: Quarkus project update
ja_jp: Quarkus プロジェクト更新

source: Quarkus proposes facilities to test extensions via the `quarkus-junit-internal` artifact (which should already be in the deployment pom.xml), in particular the `io.quarkus.test.QuarkusUnitTest` runner, which starts an application with your extension.
ja_jp: Quarkus は、`quarkus-junit-internal` アーティファクト (deployment pom.xml にすでに含まれているはずです) を介してエクステンションをテストするための機能を提供します。特に、エクステンションを使ってアプリケーションを起動する `io.quarkus.test.QuarkusUnitTest` ランナーがあります。

source: Quarkus proposes facilities to test extensions via the `quarkus-junit5-internal` artifact (which should already be in the deployment pom.xml), in particular the `io.quarkus.test.QuarkusUnitTest` runner which starts an application with your extension.
ja_jp: Quarkusは、既に deployment pom.xml にある `quarkus-junit5-internal` アーティファクトを介してエクステンションをテストするための機能を処理します (エクステンションでアプリケーションを起動する `io.quarkus.test.QuarkusUnitTest` ランナー)。

source: Quarkus provides Dev Services for all databases it supports. Most of these are run in a container, except H2 and Derby which are run in-process. Dev Services are supported for both JDBC and reactive drivers.
ja_jp: Quarkusは、サポートしているすべてのデータベースに対してDev Servicesを提供しています。これらのデータベースのほとんどはコンテナ内で実行されますが、H2とDerbyはプロセス内で実行されます。Dev Serviceは、JDBCドライバとリアクティブドライバの両方をサポートしています。

source: Quarkus provides Dev Services for all databases it supports. Most of these are run in a container, except H2 which is run in-process. Dev Services are supported for both JDBC and reactive drivers.
ja_jp: Quarkus は、サポートしているすべてのデータベースに対して Dev Services を提供しています。これらのほとんどはコンテナー内で実行されますが、H2 はプロセス内で実行されます。Dev Services は、JDBC およびリアクティブドライバーの両方をサポートしています。

source: Quarkus provides Dev Services for all databases it supports. Most of these are run in a container, with the exception of H2 and Derby which are run in process. Dev Services are supported for both JDBC and reactive drivers.
ja_jp: Quarkusは、サポートしているすべてのデータベースに対してDev Servicesを提供しています。これらのほとんどはコンテナ内で実行されますが、H2とDerbyはプロセス内で実行されます。Devサービスは、JDBCドライバとリアクティブドライバの両方に対応しています。

source: Quarkus provides Mutual TLS authentication so that you can authenticate users based on their X.509 certificates.
ja_jp: Quarkusは相互TLS認証を提供しているので、X.509証明書に基づいてユーザーを認証できます。

source: Quarkus provides `ContextualEmitter`, a drop in replacement for `MutinyEmitter` and `Emitter`, that allows you to propagate the context when sending messages. You can use the context propagation annotation `@CurrentThreadContext` to configure the contexts that will be propagated from an _emitter_ method. The annotation configures the contexts that will be captured and propagated from that method, and needs to be present on the propagator method, i.e. the caller of the emitter, not the processing method.
ja_jp: Quarkus は、メッセージを送信する際にコンテキストを伝搬できる `ContextualEmitter` (`MutinyEmitter` および `Emitter` のドロップイン代替) を提供します。 _エミッター_ メソッドから伝搬されるコンテキストを設定するには、コンテキスト伝搬アノテーション `@CurrentThreadContext` を使用できます。 このアノテーションは、そのメソッドからキャプチャーされ伝搬されるコンテキストを設定し、プロパゲーターメソッド (つまり、エミッターの呼び出し元) に存在する必要があり、処理メソッドには必要ありません。

source: Quarkus provides `create-extension` Maven Mojo to initialize your extension project.
ja_jp: Quarkus は、 `create-extension` Maven Mojo を提供し、エクステンションプロジェクトを初期化します。

source: Quarkus provides a CORS filter, which implements the `jakarta.servlet.Filter` interface and intercepts all incoming HTTP requests. It can be enabled in the Quarkus configuration file, `src/main/resources/application.properties`:
ja_jp: Quarkusには、 `jakarta.servlet.Filter` インタフェースを実装し、すべての受信HTTPリクエストをインターセプトするCORSフィルタがあります。 Quarkusの設定ファイル `src/main/resources/application.properties` で有効にできます：

source: Quarkus provides a Jakarta Persistence (formerly known as JPA) identity provider, similar to the JDBC identity provider, suitable for use with the Basic and Form-based Quarkus Security mechanisms, which require a combination of username and password credentials.
ja_jp: Quarkusには、JDBC IDプロバイダーと同様に、Jakarta Persistence（旧名称JPA）IDプロバイダーが用意されています。

source: Quarkus provides a Jakarta Persistence (formerly known as JPA) identity provider, similar to the xref:security-jdbc.adoc[JDBC identity provider], suitable for use with the xref:security-basic-authentication.adoc[Basic] and xref:security-authentication-mechanisms.adoc#form-auth[Form-based] Quarkus Security mechanisms, which require a combination of username and password credentials.
ja_jp: Quarkusには、 xref:security-jdbc.adoc[JDBC アイデンティティープロバイダー] に似たJakarta Persistence（旧称JPA）アイデンティティープロバイダーがあり、ユーザー名とパスワードの組み合わせが必要な xref:security-basic-authentication-concept.adoc[Basic] および xref:security-authentication-mechanisms-concept.adoc#form-auth[フォームベース] のQuarkusセキュリティメカニズムで使用するのに適しています。

source: Quarkus provides a Jakarta Persistence identity provider, similar to the xref:security-jdbc.adoc[JDBC identity provider]. Jakarta Persistence is suitable for use with the xref:security-basic-authentication.adoc[Basic] and xref:security-authentication-mechanisms.adoc#form-auth[Form-based] Quarkus Security mechanisms, which require username and password credentials.
ja_jp: Quarkusは、 xref:security-jdbc.adoc[JDBC IDプロバイダー] と同様に、Jakarta Persistence IDプロバイダーを提供します。Jakarta Persistenceは、ユーザー名とパスワードのクレデンシャルを必要とする、 xref:security-basic-authentication.adoc[Basic] および xref:security-authentication-mechanisms.adoc#form-auth[フォームベース] のQuarkus Securityメカニズムでの使用に適しています。

source: Quarkus provides a built-in bean of type `io.quarkus.scheduler.Scheduler` that can be injected and used to pause/resume the scheduler and individual scheduled methods identified by a specific `Scheduled#identity()`.
ja_jp: Quarkusは、 `io.quarkus.scheduler.Scheduler` 型のビルトインBeanを提供しており、これを注入してスケジューラーを一時停止/再開するために使用することができます。

source: Quarkus provides a centralized way to configure proxies using the Proxy Registry. All proxy configuration is defined under the `quarkus.proxy` configuration root.
ja_jp: Quarkus は、プロキシーレジストリーを使用してプロキシーを設定する一元的な方法を提供します。すべてのプロキシー設定は、`quarkus.proxy` 設定ルートの下で定義されます。

source: Quarkus provides a cohesive, full-stack framework with a rich ecosystem of extensions, enabling the Polaris community to focus on catalog features rather than assembling infrastructure plumbing.
ja_jp: Quarkus は、豊富なエクステンションエコシステムを備えた、まとまりのあるフルスタックフレームワークを提供し、Polaris コミュニティがインフラストラクチャの配管を構築するのではなく、カタログ機能に集中できるようにします。

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of hundreds of best-of-breed libraries that you love and use. All wired on a standard backbone.
ja_jp: Quarkus は、愛用されている数百もの各分野における最高のライブラリーを活用することで、まとまりのある、楽しく使えるフルスタック フレームワークを提供します。これらはすべて、標準のバックボーンに接続されています。

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of hundreds of best-of-breed libraries that you love and use. All wired on a standard backbone. <a href="/standards">Learn more about Quarkus Extensions</a>.
ja_jp: Quarkusは、ユーザーが愛用している数百ものベストオブブリードライブラリを活用することで、まとまりのある、使いやすいフルスタックフレームワークを提供します。<a href="/standards">Quarkusのエクステンションについての詳細</a>。

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of over fifty best-of-breed libraries that you love and use. All wired on a standard backbone.
ja_jp: Quarkusは、ユーザーが愛用している50以上の各分野最高のライブラリを活用することで、凝集度の高い、楽しく使えるフルスタックフレームワークを提供しています。すべてが標準的なバックボーンで構成されています。

source: Quarkus provides a compatibility layer for Spring Cloud Config in the form of the spring-cloud-config-client extension.
ja_jp: Quarkusは、Spring-cloud-config-clientエクステンションの形でSpring Cloud Config用の互換性レイヤーを提供しています。

source: Quarkus provides a default `ValidatorFactory` that you can customize using configuration properties. This `ValidatorFactory` is carefully initialized to support native executables using a bootstrap that is Quarkus-specific.
ja_jp: Quarkusは、設定プロパティを使用してカスタマイズ可能なデフォルトの `ValidatorFactory` を提供します。この `ValidatorFactory` は、Quarkus 固有のブートストラップを使用してネイティブ実行可能ファイルをサポートするように慎重に初期化されています。

source: Quarkus provides a dev mode (explained in more detail xref:maven-tooling.adoc#dev-mode[here] and link:gradle-tooling#dev-mode[here]) which greatly aids during development but should *NEVER* be used in production.
ja_jp: Quarkus には開発モード (詳細は link:maven-tooling.html#dev-mode[こちら]と link:gradle-tooling#dev-mode[こちら]) があり、開発に大いに役立ちます。

source: Quarkus provides a dev mode which greatly aids during development but should *NEVER* be used in production.
ja_jp: Quarkus は開発中に大いに役立つ開発モードを提供しますが、本番環境で *絶対* に使用してはいけません。

source: Quarkus provides a dev-mode (explained in more detail xref:maven-tooling.adoc#dev-mode[here] and link:gradle-tooling#dev-mode[here]) which greatly aids during development but should *NEVER* be used in production.
ja_jp: Quarkusには開発モード（詳細は link:maven-tooling.html#dev-mode[こちら]と link:gradle-tooling#dev-mode[こちら]）があり、開発に大いに役立ちます。

source: Quarkus provides a distroless base image that you can use in your `Dockerfile`. You only need to copy your application, and you are done:
ja_jp: Quarkus は、 `Dockerfile` で使用できる distroless ベースイメージを提供します。ユーザーは、アプリケーションをコピーするだけです:

source: Quarkus provides a few implementations of `QuarkusTestResourceLifecycleManager` out of the box (see `io.quarkus.test.h2.H2DatabaseTestResource` which starts an H2 database, or `io.quarkus.test.kubernetes.client.KubernetesServerTestResource` which starts a mock Kubernetes API server), but it is common to create custom implementations to address specific application needs. Common cases include starting docker containers using https://www.testcontainers.org/[Testcontainers] (an example of which can be found https://github.com/quarkusio/quarkus/blob/main/test-framework/keycloak-server/src/main/java/io/quarkus/test/keycloak/server/KeycloakTestResourceLifecycleManager.java[here]), or starting a mock HTTP server using http://wiremock.org/[Wiremock] (an example of which can be found https://github.com/geoand/quarkus-test-demo/blob/main/src/test/java/org/acme/getting/started/country/WiremockCountries.java[here]).
ja_jp: Quarkusでは、 `QuarkusTestResourceLifecycleManager` の実装がいくつか提供されていますが (H2 データベースを起動する `io.quarkus.test.h2.H2DatabaseTestResource` や、モック Kubernetes API サーバーを起動する `io.quarkus.test.kubernetes.client.KubernetesServerTestResource` を参照)、特定のアプリケーションのニーズに対応するためにカスタム実装を作成するのが一般的です。一般的なケースとしては、link:https://www.testcontainers.org/[Testcontainers] を使用した docker コンテナーの起動 (その例は link:https://github.com/quarkusio/quarkus-quickstarts/blob/master/kafka-quickstart/src/test/java/org/acme/kafka/KafkaResource.java[こちら] を参照)、link:http://wiremock.org/[Wiremock] を使用したモック HTTP サーバの起動 (その例は link:https://github.com/geoand/quarkus-test-demo/blob/master/src/test/java/org/acme/getting/started/country/WiremockCountries.java[こちら] を参照) などがあります。

source: Quarkus provides a few implementations of `QuarkusTestResourceLifecycleManager` out of the box (see `io.quarkus.test.h2.H2DatabaseTestResource` which starts an H2 database, or `io.quarkus.test.kubernetes.client.KubernetesServerTestResource` which starts a mock Kubernetes API server), but it is common to create custom implementations to address specific application needs. Common cases include starting docker containers using https://www.testcontainers.org/[Testcontainers] (an example of which can be found https://github.com/quarkusio/quarkus/blob/main/test-framework/keycloak-server/src/main/java/io/quarkus/test/keycloak/server/KeycloakTestResourceLifecycleManager.java[here]), or starting a mock HTTP server using https://wiremock.org/[Wiremock] (an example of which can be found https://github.com/geoand/quarkus-test-demo/blob/main/src/test/java/org/acme/getting/started/country/WiremockCountries.java[here]).
ja_jp: Quarkus では、 `QuarkusTestResourceLifecycleManager` の実装がいくつか提供されていますが (H2 データベースを起動する `io.quarkus.test.h2.H2DatabaseTestResource` や、モック Kubernetes API サーバーを起動する `io.quarkus.test.kubernetes.client.KubernetesServerTestResource` を参照)、 特定のアプリケーションのニーズに対応するためにカスタム実装を作成するのが一般的です。 一般的なケースとしては、link:https://www.testcontainers.org/[Testcontainers] を使用した docker コンテナーの起動 (その例は https://github.com/quarkusio/quarkus/blob/main/test-framework/keycloak-server/src/main/java/io/quarkus/test/keycloak/server/KeycloakTestResourceLifecycleManager.java[こちら] を参照)、 link:https://wiremock.org/[Wiremock] を使用したモック HTTP サーバの起動 (その例は link:https://github.com/geoand/quarkus-test-demo/blob/master/src/test/java/org/acme/getting/started/country/WiremockCountries.java[こちら] を参照) などがあります。

source: Quarkus provides a great xref:dev-ui.adoc[Dev UI] experience. Specifically, Quarkus offers built-in support for developing and testing OIDC endpoints with a Keycloak container. xref:security-openid-connect-dev-services.adoc#dev-services-for-keycloak[DevService for Keycloak] is automatically started and used if the address of the OIDC provider is not specified for the Quarkus `quarkus.oidc.auth-server-url` configuration property.
ja_jp: Quarkus は優れた xref:dev-ui.adoc[Dev UI] エクスペリエンスを提供します。 具体的には、Quarkus は、Keycloak コンテナーを使用して OIDC エンドポイントを開発およびテストするための組込サポートを提供します。 Quarkus の `quarkus.oidc.auth-server-url` 設定プロパティーに OIDC プロバイダーのアドレスが指定されていない場合、xref:security-openid-connect-dev-services.adoc#dev-services-for-keycloak[DevService for Keycloak] が自動的に起動され、使用されます。

source: Quarkus provides a set of built-in extension methods.
ja_jp: Quarkusは、組み込みの拡張メソッドのセットを提供しています。

source: Quarkus provides a specialized `aot-jar` packaging type designed to work optimally with OpenJDK's AOT features. This packaging type:
ja_jp: Quarkus は、OpenJDK の AOT 機能と最適に動作するように設計された、専用の `aot-jar` パッケージングタイプを提供します。このパッケージングタイプは以下の特徴を持ちます。

source: Quarkus provides a very comprehensive HashiCorp Vault support, please see the link:{vault-guide}[Quarkus and HashiCorp Vault] documentation for more information.
ja_jp: Quarkusは非常に包括的な HashiCorp Vault のサポートを提供しています。詳しくは link:vault[QuarkusとHashiCorp Vault] のドキュメントを参照下さい。

source: Quarkus provides a very useful xref:dev-ui.adoc[UI] accessible from the browser at `/q/dev-ui`. This UI allows a developer to see the state of the application, but also provides access to various actions that can change that state (depending on the extensions that are present). Examples of such operations are:
ja_jp: Quarkusは、ブラウザから `/q/dev-ui` でアクセスできる非常に便利な xref:dev-ui.adoc[UI] を提供しています。このUIにより、開発者はアプリケーションの状態を確認できるだけでなく、その状態を変更できるさまざまな操作にアクセスできます（存在するエクステンションに依存）。そのような操作の例としては、以下のようなものがあります:

source: Quarkus provides a very useful xref:dev-ui.adoc[UI] accessible from the browser at `/q/dev`. This UI allows a developer to see the state of the application, but also provides access to various actions that can change that state (depending on the extensions that are present). Examples of such operations are:
ja_jp: Quarkusは、 `/q/dev` でブラウザからアクセスできる非常に便利な link:dev-ui.html[UI]を提供しています 。このUIにより、開発者はアプリケーションの状態を確認できるだけでなく、（存在するエクステンションに応じて）その状態を変更できる様々な操作にアクセスできます。そのような操作の例は以下の通りです:

source: Quarkus provides a xref:./tls-registry-reference.adoc[TLS centralized configuration] that can be used to configure the server's TLS context. It is the recommended approach to configure HTTPS.
ja_jp: Quarkus は、サーバーの TLS コンテキストを設定するために使用できる xref:./tls-registry-reference.adoc[TLS 集中設定] を提供します。 HTTPS を設定することが推奨される方法です。

source: Quarkus provides additional extensions in Quarkiverse for securely storing credentials, for example, link:{vault-guide}[Quarkus and HashiCorp Vault].
ja_jp: Quarkus は、link:{vault-guide}[Quarkus や HashiCorp Vault] など、認証情報をセキュアに保存するための追加のエクステンションを Quarkiverse に提供します。

source: Quarkus provides additional extensions which cover other configuration formats and stores:
ja_jp: Quarkus は、他の設定フォーマットとストアをカバーする追加のエクステンションを提供します。

source: Quarkus provides an extension called `quarkus-resteasy-multipart` to make things easier for you.
ja_jp: Quarkusは 、 `quarkus-resteasy-multipart` というエクステンションを提供しています。

source: Quarkus provides built-in support for testing your Funqy Google Cloud functions via the `quarkus-test-google-cloud-functions` dependency.
ja_jp: Quarkusは、 `quarkus-test-google-cloud-functions` の依存関係を介してFunqy Google Cloud functions をテストするためのサポートを提供しています。

source: Quarkus provides built-in support for testing your Google Cloud functions via the `quarkus-test-google-cloud-functions` dependency.
ja_jp: Quarkusは、 `quarkus-test-google-cloud-functions` の依存関係を介して、Google Cloud functionsをテストするためのサポートを提供しています。

source: Quarkus provides compatibility with the following Spring Cache annotations:
ja_jp: Quarkusは、以下のSpring Cacheアノテーションとの互換性を提供しています。

source: Quarkus provides comprehensive HashiCorp Vault support. For more information, see the link:{vault-guide}[Quarkus and HashiCorp Vault] documentation.
ja_jp: Quarkusは、HashiCorp Vaultを包括的にサポートしています。詳細については、 link:{vault-guide}[QuarkusとHashiCorp Vault] のドキュメントを参照してください。

source: Quarkus provides developers the tools and capabilities to troubleshoot distributed microservices applications in Kubernetes including tracing and debugging.
ja_jp: Quarkusは、トレースやデバッグなど、Kubernetes上の分散型マイクロサービスアプリケーションをトラブルシューティングするためのツールと機能を開発者に提供します。

source: Quarkus provides different log levels, which helps developers control the amount of information logged based on the severity of the events.
ja_jp: Quarkusにはさまざまなログレベルが用意されており、開発者はイベントの重大性に基づいてログに記録される情報量を制御できます。

source: Quarkus provides driver extensions for:
ja_jp: Quarkus は、以下のためのドライバーエクステンションを提供しています。

source: Quarkus provides explicit support for testing with different users, and with the security subsystem disabled. To use this you must include the `quarkus-test-security` dependency:
ja_jp: Quarkusは、異なるユーザーでのテストや、セキュリティーサブシステムを無効にした状態でのテストを明示的にサポートしています。これを使用するには、 `quarkus-test-security` のアーティファクトを含める必要があります。

source: Quarkus provides extensions for building (and pushing) container images. Currently it supports:
ja_jp: Quarkus は、コンテナーイメージを構築 (およびプッシュ) するためのエクステンションを提供しています。現在は以下をサポートしています。

source: Quarkus provides extensions for building (and pushing) container images. Currently, it supports:
ja_jp: Quarkus は、コンテナーイメージをビルド (およびプッシュ) するためのエクステンションを提供しています。現在は以下をサポートしています。
